# ************************************************************
# Sequel Pro SQL dump
# バージョン 4541
#
# http://www.sequelpro.com/
# https://github.com/sequelpro/sequelpro
#
# ホスト: 127.0.0.1 (MySQL 5.6.51)
# データベース: mzn
# 作成時刻: 2022-02-20 04:41:05 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# テーブルのダンプ city
# ------------------------------------------------------------

DROP TABLE IF EXISTS `city`;

CREATE TABLE `city` (
  `large_area_id` int(11) DEFAULT NULL,
  `name` text COLLATE utf8_unicode_ci,
  `citycode` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `city` WRITE;
/*!40000 ALTER TABLE `city` DISABLE KEYS */;

INSERT INTO `city` (`large_area_id`, `name`, `citycode`)
VALUES
	(1,'札幌市中央区',10001),
	(1,'札幌市北区',10002),
	(1,'札幌市東区',10003),
	(1,'札幌市白石区',10004),
	(1,'札幌市豊平区',10005),
	(1,'札幌市南区',10006),
	(1,'札幌市西区',10007),
	(1,'札幌市厚別区',10008),
	(1,'札幌市手稲区',10009),
	(1,'札幌市清田区',10010),
	(2,'仙台市青葉区',40001),
	(2,'仙台市宮城野区',40002),
	(2,'仙台市若林区',40003),
	(2,'仙台市泉区',40004),
	(3,'さいたま市西区',110001),
	(3,'さいたま市北区',110002),
	(3,'さいたま市見沼区',110004),
	(3,'さいたま市大宮区',110003),
	(3,'さいたま市中央区',110005),
	(3,'さいたま市桜区',110006),
	(3,'さいたま市浦和区',110007),
	(3,'さいたま市南区',110008),
	(3,'さいたま市緑区',110009),
	(3,'さいたま市岩槻区',110010),
	(3,'千葉市中央区',120001),
	(3,'千葉市花見川区',120002),
	(3,'千葉市稲毛区',120003),
	(3,'千葉市若葉区',120004),
	(3,'千葉市緑区',120005),
	(3,'千葉市美浜区',120006),
	(3,'東京都千代田区',130001),
	(3,'東京都中央区',130002),
	(3,'東京都港区',130003),
	(3,'東京都新宿区',130004),
	(3,'東京都文京区',130005),
	(3,'東京都台東区',130006),
	(3,'東京都墨田区',130007),
	(3,'東京都江東区',130008),
	(3,'東京都品川区',130009),
	(3,'東京都目黒区',130010),
	(3,'東京都大田区',130011),
	(3,'東京都世田谷区',130012),
	(3,'東京都渋谷区',130013),
	(3,'東京都中野区',130014),
	(3,'東京都杉並区',130015),
	(3,'東京都豊島区',130016),
	(3,'東京都北区',130017),
	(3,'東京都荒川区',130018),
	(3,'東京都板橋区',130019),
	(3,'東京都練馬区',130020),
	(3,'東京都足立区',130021),
	(3,'東京都葛飾区',130022),
	(3,'東京都江戸川区',130023),
	(3,'横浜市鶴見区',140001),
	(3,'横浜市神奈川区',140002),
	(3,'横浜市西区',140003),
	(3,'横浜市中区',140004),
	(3,'横浜市南区',140005),
	(3,'横浜市保土ケ谷区',140006),
	(3,'横浜市磯子区',140007),
	(3,'横浜市金沢区',140008),
	(3,'横浜市港北区',140009),
	(3,'横浜市戸塚区',140010),
	(3,'横浜市港南区',140011),
	(3,'横浜市旭区',140012),
	(3,'横浜市緑区',140013),
	(3,'横浜市瀬谷区',140014),
	(3,'横浜市栄区',140015),
	(3,'横浜市泉区',140016),
	(3,'横浜市青葉区',140017),
	(3,'横浜市都筑区',140018),
	(3,'川崎市川崎区',140019),
	(3,'川崎市幸区',140020),
	(3,'川崎市中原区',140021),
	(3,'川崎市高津区',140022),
	(3,'川崎市多摩区',140023),
	(3,'川崎市宮前区',140024),
	(3,'川崎市麻生区',140025),
	(3,'相模原市緑区',140026),
	(3,'相模原市中央区',140027),
	(3,'相模原市南区',140028),
	(4,'新潟市北区',150001),
	(4,'新潟市東区',150002),
	(4,'新潟市中央区',150003),
	(4,'新潟市江南区',150004),
	(4,'新潟市秋葉区',150005),
	(4,'新潟市南区',150006),
	(4,'新潟市西区',150007),
	(4,'新潟市西蒲区',150008),
	(4,'静岡市葵区',220001),
	(4,'静岡市駿河区',220002),
	(4,'静岡市清水区',220003),
	(4,'浜松市中区',220004),
	(4,'浜松市東区',220005),
	(4,'浜松市西区',220006),
	(4,'浜松市南区',220007),
	(4,'浜松市北区',220008),
	(4,'浜松市浜北区',220009),
	(4,'浜松市天竜区',220010),
	(4,'名古屋市千種区',230001),
	(4,'名古屋市東区',230002),
	(4,'名古屋市北区',230003),
	(4,'名古屋市西区',230004),
	(4,'名古屋市中村区',230005),
	(4,'名古屋市中区',230006),
	(4,'名古屋市昭和区',230007),
	(4,'名古屋市瑞穂区',230008),
	(4,'名古屋市熱田区',230009),
	(4,'名古屋市中川区',230010),
	(4,'名古屋市港区',230011),
	(4,'名古屋市南区',230012),
	(4,'名古屋市守山区',230013),
	(4,'名古屋市緑区',230014),
	(4,'名古屋市名東区',230015),
	(4,'名古屋市天白区',230016),
	(5,'京都市北区',260001),
	(5,'京都市上京区',260002),
	(5,'京都市左京区',260003),
	(5,'京都市中京区',260004),
	(5,'京都市東山区',260005),
	(5,'京都市下京区',260006),
	(5,'京都市南区',260007),
	(5,'京都市右京区',260008),
	(5,'京都市伏見区',260009),
	(5,'京都市山科区',260010),
	(5,'京都市西京区',260011),
	(5,'大阪市都島区',270001),
	(5,'大阪市福島区',270002),
	(5,'大阪市此花区',270003),
	(5,'大阪市西区',270004),
	(5,'大阪市港区',270005),
	(5,'大阪市大正区',270006),
	(5,'大阪市天王寺区',270007),
	(5,'大阪市浪速区',270008),
	(5,'大阪市西淀川区',270009),
	(5,'大阪市東淀川区',270010),
	(5,'大阪市東成区',270011),
	(5,'大阪市生野区',270012),
	(5,'大阪市旭区',270013),
	(5,'大阪市城東区',270014),
	(5,'大阪市阿倍野区',270015),
	(5,'大阪市住吉区',270016),
	(5,'大阪市東住吉区',270017),
	(5,'大阪市西成区',270018),
	(5,'大阪市淀川区',270019),
	(5,'大阪市鶴見区',270020),
	(5,'大阪市住之江区',270021),
	(5,'大阪市平野区',270022),
	(5,'大阪市北区',270023),
	(5,'大阪市中央区',270024),
	(5,'堺市堺区',270025),
	(5,'堺市中区',270026),
	(5,'堺市東区',270027),
	(5,'堺市西区',270028),
	(5,'堺市南区',270029),
	(5,'堺市北区',270030),
	(5,'堺市美原区',270031),
	(5,'神戸市東灘区',280001),
	(5,'神戸市灘区',280002),
	(5,'神戸市兵庫区',280003),
	(5,'神戸市長田区',280004),
	(5,'神戸市須磨区',280005),
	(5,'神戸市垂水区',280006),
	(5,'神戸市北区',280007),
	(5,'神戸市中央区',280008),
	(5,'神戸市西区',280009),
	(6,'岡山市北区',330001),
	(6,'岡山市中区',330002),
	(6,'岡山市東区',330003),
	(6,'岡山市南区',330004),
	(6,'広島市中区',340001),
	(6,'広島市東区',340002),
	(6,'広島市南区',340003),
	(6,'広島市西区',340004),
	(6,'広島市安佐南区',340005),
	(6,'広島市安佐北区',340006),
	(6,'広島市安芸区',340007),
	(6,'広島市佐伯区',340008),
	(8,'北九州市門司区',400001),
	(8,'北九州市若松区',400002),
	(8,'北九州市戸畑区',400003),
	(8,'北九州市小倉北区',400004),
	(8,'北九州市小倉南区',400005),
	(8,'北九州市八幡東区',400006),
	(8,'北九州市八幡西区',400007),
	(8,'福岡市東区',400008),
	(8,'福岡市博多区',400009),
	(8,'福岡市中央区',400010),
	(8,'福岡市南区',400011),
	(8,'福岡市西区',400012),
	(8,'福岡市城南区',400013),
	(8,'福岡市早良区',400014),
	(8,'熊本市中央区',430001),
	(8,'熊本市東区',430002),
	(8,'熊本市西区',430003),
	(8,'熊本市南区',430004),
	(8,'熊本市北区',430005);

/*!40000 ALTER TABLE `city` ENABLE KEYS */;
UNLOCK TABLES;


# テーブルのダンプ large_area
# ------------------------------------------------------------

DROP TABLE IF EXISTS `large_area`;

CREATE TABLE `large_area` (
  `name` varchar(11) COLLATE utf8_unicode_ci DEFAULT NULL,
  `prefecture_name` text COLLATE utf8_unicode_ci,
  `prefecture_id` int(11) DEFAULT NULL,
  `large_area_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `large_area` WRITE;
/*!40000 ALTER TABLE `large_area` DISABLE KEYS */;

INSERT INTO `large_area` (`name`, `prefecture_name`, `prefecture_id`, `large_area_id`)
VALUES
	(NULL,'北海道地方',NULL,1),
	(NULL,'東北地方',NULL,2),
	(NULL,'関東地方',NULL,3),
	(NULL,'中部地方',NULL,4),
	(NULL,'近畿地方',NULL,5),
	(NULL,'中国地方',NULL,6),
	(NULL,'四国地方',NULL,7),
	(NULL,'九州地方',NULL,8);

/*!40000 ALTER TABLE `large_area` ENABLE KEYS */;
UNLOCK TABLES;


# テーブルのダンプ prefecture
# ------------------------------------------------------------

DROP TABLE IF EXISTS `prefecture`;

CREATE TABLE `prefecture` (
  `prefecture_id` int(11) DEFAULT NULL,
  `name` text COLLATE utf8_unicode_ci,
  `large_area_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `prefecture` WRITE;
/*!40000 ALTER TABLE `prefecture` DISABLE KEYS */;

INSERT INTO `prefecture` (`prefecture_id`, `name`, `large_area_id`)
VALUES
	(1,'北海道',1),
	(2,'青森県',2),
	(3,'岩手県',2),
	(4,'宮城県',2),
	(5,'秋田県',2),
	(6,'山形県',2),
	(7,'福島県',2),
	(8,'茨城県',3),
	(9,'栃木県',3),
	(10,'群馬県',3),
	(11,'埼玉県',3),
	(12,'千葉県',3),
	(13,'東京都',3),
	(14,'神奈川県',3),
	(15,'新潟県',4),
	(16,'富山県',4),
	(17,'石川県',4),
	(18,'福井県',4),
	(19,'山梨県',4),
	(20,'長野県',4),
	(21,'岐阜県',4),
	(22,'静岡県',4),
	(23,'愛知県',4),
	(24,'三重県',5),
	(25,'滋賀県',5),
	(26,'京都府',5),
	(27,'大阪府',5),
	(28,'兵庫県',5),
	(29,'奈良県',5),
	(30,'和歌山県',5),
	(31,'鳥取県',6),
	(32,'島根県',6),
	(33,'岡山県',6),
	(34,'広島県',6),
	(35,'山口県',6),
	(36,'徳島県',7),
	(37,'香川県',7),
	(38,'愛媛県',7),
	(39,'高知県',7),
	(40,'福岡県',8),
	(41,'佐賀県',8),
	(42,'長崎県',8),
	(43,'熊本県',8),
	(44,'大分県',8),
	(45,'宮崎県',8),
	(46,'鹿児島県',8),
	(47,'沖縄県',8);

/*!40000 ALTER TABLE `prefecture` ENABLE KEYS */;
UNLOCK TABLES;


# テーブルのダンプ users
# ------------------------------------------------------------

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(11) NOT NULL DEFAULT '',
  `create_timestamp` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_timestamp` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `create_timestamp` (`create_timestamp`),
  KEY `update_timestamp` (`update_timestamp`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='user管理テーブル';

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;

INSERT INTO `users` (`id`, `name`, `create_timestamp`, `update_timestamp`)
VALUES
	(1,'前田','2022-01-18 12:08:54','2022-01-18 12:17:23'),
	(2,'斉藤','2022-01-18 12:09:23','2022-01-18 12:17:30'),
	(3,'山田','2022-01-18 12:09:35','2022-01-18 12:17:36'),
	(4,'中村','2022-01-18 12:09:45','2022-01-18 12:17:43'),
	(5,'佐藤','2022-01-18 12:09:55','2022-01-18 12:17:16'),
	(6,'田中','2022-01-18 12:10:01','2022-01-18 12:17:47'),
	(7,'鈴木','2022-01-18 12:10:06','2022-01-18 12:17:52'),
	(8,'加藤','2022-01-18 12:10:11','2022-01-18 12:17:55'),
	(9,'田中','2022-01-18 12:10:17','2022-01-18 12:18:11'),
	(10,'渡辺','2022-01-18 12:10:24','2022-01-18 12:18:18'),
	(11,'真田','2022-01-18 12:10:33','2022-01-18 12:18:26'),
	(12,'鳥居','2022-01-18 12:10:41','2022-01-18 12:19:42'),
	(13,'松田','2022-01-18 12:10:50','2022-01-18 12:20:01'),
	(14,'山本','2022-01-18 12:10:55','2022-01-18 12:20:52'),
	(15,'川内','2022-01-18 12:11:02','2022-01-18 12:21:04'),
	(16,'工藤','2022-01-18 12:12:06','2022-01-18 12:21:53'),
	(17,'山下','2022-01-18 12:12:12','2022-01-18 12:22:51'),
	(18,'岩田','2022-01-18 12:12:17','2022-01-18 12:22:56'),
	(19,'赤塚','2022-01-18 12:12:23','2022-01-18 12:23:29'),
	(20,'佐々木','2022-01-18 12:12:28','2022-01-18 12:24:00');

/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
